XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/dma_reg.h
    /* 0x608 : DMA_C5LLI */
    union {
        struct {
            uint32_t LLI : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5LLI;

    /* 0x60C : DMA_C5Control */
    union {
        struct {
            uint32_t TransferSize : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t SBSize       : 2;  /* [13:12],        r/w,        0x1 */
            uint32_t dst_min_mode : 1;  /* [   14],        r/w,        0x0 */
            uint32_t DBSize       : 2;  /* [16:15],        r/w,        0x1 */
            uint32_t dst_add_mode : 1;  /* [   17],        r/w,        0x0 */
            uint32_t SWidth       : 2;  /* [19:18],        r/w,        0x2 */
            uint32_t reserved_20  : 1;  /* [   20],       rsvd,        0x0 */
            uint32_t DWidth       : 2;  /* [22:21],        r/w,        0x2 */
            uint32_t fix_cnt      : 3;  /* [25:23],        r/w,        0x0 */
            uint32_t SI           : 1;  /* [   26],        r/w,        0x1 */
            uint32_t DI           : 1;  /* [   27],        r/w,        0x1 */
            uint32_t Prot         : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t I            : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5Control;

    /* 0x610 : DMA_C5Config */
    union {
        struct {
            uint32_t E              : 1;  /* [    0],        r/w,        0x0 */
            uint32_t SrcPeripheral  : 5;  /* [ 5: 1],        r/w,        0x0 */
            uint32_t DstPeripheral  : 5;  /* [10: 6],        r/w,        0x0 */
            uint32_t FlowCntrl      : 3;  /* [13:11],        r/w,        0x0 */
            uint32_t IE             : 1;  /* [   14],        r/w,        0x0 */
            uint32_t ITC            : 1;  /* [   15],        r/w,        0x0 */
            uint32_t L              : 1;  /* [   16],        r/w,        0x0 */
            uint32_t A              : 1;  /* [   17],          r,        0x0 */
            uint32_t H              : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5Config;

    /* 0x614  reserved */
    uint8_t RESERVED0x614[8];

    /* 0x61C : DMA_C5RSVD */
    union {
        struct {
            uint32_t reserved_0_2  : 3;  /* [ 2: 0],       rsvd,        0x0 */
            uint32_t DstRemnSgle   : 1;  /* [    3],        r/w,        0x0 */
            uint32_t SrcRemnSgle   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_31 : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5RSVD;

    /* 0x620  reserved */
    uint8_t RESERVED0x620[224];

    /* 0x700 : DMA_C6SrcAddr */
    union {
        struct {
            uint32_t SrcAddr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C6SrcAddr;

    /* 0x704 : DMA_C6DstAddr */
    union {
        struct {
            uint32_t DstAddr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C6DstAddr;

    /* 0x708 : DMA_C6LLI */
    union {
        struct {
            uint32_t LLI : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C6LLI;

    /* 0x70C : DMA_C6Control */
    union {
        struct {
            uint32_t TransferSize : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t SBSize       : 2;  /* [13:12],        r/w,        0x1 */
            uint32_t dst_min_mode : 1;  /* [   14],        r/w,        0x0 */
            uint32_t DBSize       : 2;  /* [16:15],        r/w,        0x1 */
            uint32_t dst_add_mode : 1;  /* [   17],        r/w,        0x0 */
            uint32_t SWidth       : 2;  /* [19:18],        r/w,        0x2 */
            uint32_t reserved_20  : 1;  /* [   20],       rsvd,        0x0 */
            uint32_t DWidth       : 2;  /* [22:21],        r/w,        0x2 */
            uint32_t fix_cnt      : 3;  /* [25:23],        r/w,        0x0 */
            uint32_t SI           : 1;  /* [   26],        r/w,        0x1 */
            uint32_t DI           : 1;  /* [   27],        r/w,        0x1 */
            uint32_t Prot         : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t I            : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C6Control;

    /* 0x710 : DMA_C6Config */
    union {
        struct {
            uint32_t E              : 1;  /* [    0],        r/w,        0x0 */
            uint32_t SrcPeripheral  : 5;  /* [ 5: 1],        r/w,        0x0 */
            uint32_t DstPeripheral  : 5;  /* [10: 6],        r/w,        0x0 */
            uint32_t FlowCntrl      : 3;  /* [13:11],        r/w,        0x0 */
            uint32_t IE             : 1;  /* [   14],        r/w,        0x0 */
            uint32_t ITC            : 1;  /* [   15],        r/w,        0x0 */
            uint32_t L              : 1;  /* [   16],        r/w,        0x0 */
            uint32_t A              : 1;  /* [   17],          r,        0x0 */
            uint32_t H              : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C6Config;

    /* 0x714  reserved */
    uint8_t RESERVED0x714[8];

    /* 0x71C : DMA_C6RSVD */
    union {
        struct {
            uint32_t reserved_0_2  : 3;  /* [ 2: 0],       rsvd,        0x0 */
            uint32_t DstRemnSgle   : 1;  /* [    3],        r/w,        0x0 */
            uint32_t SrcRemnSgle   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_31 : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C6RSVD;

    /* 0x720  reserved */
    uint8_t RESERVED0x720[224];

    /* 0x800 : DMA_C7SrcAddr */
    union {
        struct {
            uint32_t SrcAddr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C7SrcAddr;

